Repository: Spirals-Team/librepair-experiments
Catalog: scripts/src/main/resources/org/orbisgis/orbiswps/scripts/translation/*.po
Languages: fr

source: IO
fr: ES

source: Network
fr: Analyse de graphes

source: Vector
fr: Vecteur

source: Convert
fr: Conversion

source: Create
fr: Création

source: Operators
fr: Opérateurs

source: Properties
fr: Propriétés

source: Transform
fr: Transformation

source: Unable to retrieve the WpsService from OrbisGIS. The processes won't be loaded.
fr: Impossible d'obtenir le WpsService d'OrbisGIS. Le traitement ne peut pas être chargé.

source: Unable to retrieve the WpsService from OrbisGIS. The processes won't be removed.
fr: Impossible d'obtenir le WpsService d'OrbisGIS. Le traitement ne peut pas être supprimé.

source: Unable to create the OrbisGIS temporary folder.
fr: Impossible de créer le dossier temporaire pour OrbisGIS.

source: Unable to create the script file.
fr: Impossible de créer le fichier script.

source: Unable to copy the content of the script to the temporary file.
fr: Impossible de copier le contenu du script dans le fichier temporaire.

source: Unable to create the icon file.
fr: Impossible de créer le fichier icône.

source: Unable to copy the content of the icon to the temporary file.
fr: Impossible de copier le contenu du fichier icône vers le fichier temporaire.
