package ru.job4j.startcollection;
/**
 * тут у нас будет содержаться тестовый класс
 * в нём я буду повторять действия за учителем чтобы понять основы коллекций
 * Коллекции это динамически - расширяемые структуры данных
 * основыные плюсы коллекций :
 * 1  в отличие от массивов они динамически расширяются
 * 2 в отличие от массивов коллекции могут использовать не только индексную адресацию к премеру
 * коллекции типа связанных списков, и деревьев
 * 3 коллекции имеют одну общюю основу алгоритмов
 * коллекции делятся на типы по способам хранения информации:
 *  динамические массивы, связанные списки, деревья, хеш-таблицы
 *  коллекции могут хранить в себе значения только ссылочного типа, и классов обёрток
 *
 */