/**
 * @author anton.
 * 8. Реализовать собственную структуру данных - справочник. [#1008]
 * Справочник должен быть унифицирован через генерики.
 * иметь методы
 * boolean insert(T key, V value);
 * V get(T key);
 * boolean delete(T key);
 * Реализовывать итератор.
 * Внутренняя реализация должна использовать массив.
 * нужно обеспечить фиксированное время вставки и получение.
 *
 * Коллизии реализовывать не надо. если ключ уже есть. то возвращать false.
 */
package ru.aserdyuchenko.map.task_8;